@echo off

REM -----------------------------------------------------------------------
REM ffpmegパラメータ(ビットレート)
REM -----------------------------------------------------------------------
REM set bitrate=2.0M
set bitrate=3.0M
REM set bitrate=12M
REM -----------------------------------------------------------------------
REM ffpmegパラメータ(アスペクト比)
REM -----------------------------------------------------------------------
REM set aspect=-aspect 16:9
REM set aspect=-aspect 4:3
REM -----------------------------------------------------------------------
REM ffpmegパラメータ(リサイズ)
REM -----------------------------------------------------------------------
REM set resize=-s 1280x720 -sws_flags spline
REM -----------------------------------------------------------------------
REM ffpmegパラメータ(インターレース解除: 単純解除 / 逆テレシネ / BOB化)
REM -----------------------------------------------------------------------
REM set deint=-vf bwdif=0:-1:1
REM set deint=-vf fieldmatch=order=auto:combmatch=none,yadif=0:-1:1,decimate
REM set deint=-vf bwdif=1:-1:1

REM -----------------------------------------------------------------------
REM プログラムフォルダと出力先フォルダ
REM -----------------------------------------------------------------------
set program_dir=C:\DTV\Encode\
set output_dir=F:\Encode\
REM -----------------------------------------------------------------------
REM プログラムファイル名
REM -----------------------------------------------------------------------
set ffmpeg_path="%program_dir%ffmpeg.exe"

REM -----------------------------------------------------------------------
REM ループ処理の開始
REM -----------------------------------------------------------------------
:loop
if "%~1" == "" goto end

set input_avs="%~1"
set filename=%~n1

REM -----------------------------------------------------------------------
REM 出力ファイル名
REM -----------------------------------------------------------------------
set output_mp4="%output_dir%%filename%.mp4"

echo ======================================================================
echo 処理開始: %date% %time%
echo ======================================================================
echo %input_avs%
echo.

REM -----------------------------------------------------------------------
REM ffmpegでエンコード
REM -----------------------------------------------------------------------
%ffmpeg_path% -i %input_avs% %aspect% %resize% -vcodec hevc_nvenc -b:v %bitrate% %deint% %output_mp4%

echo ======================================================================
echo 処理終了: %date% %time%
echo.
echo.

shift
goto loop
:end

pause
exit
